Repository: theonlyalibek/budget
Catalog: Resources/Localizable.xcstrings
Source language: ru
Languages: en, kk

# tab_dashboard
source: Главная
en: Dashboard
kk: Басты бет

# tab_history
source: История
en: History
kk: Тарих

# tab_add
source: Добавить
en: Add
kk: Қосу

# tab_import
source: Импорт
en: Import

# tab_settings
source: Настройки
en: Settings
kk: Баптаулар

# category_food
source: Продукты
en: Food
kk: Азық-түлік

# category_transport
source: Транспорт
en: Transport
kk: Көлік

# category_housing
source: Жильё
en: Housing
kk: Тұрғын үй

# category_utilities
source: Коммунальные
en: Utilities
kk: Коммуналдық

# category_entertainment
source: Развлечения
en: Entertainment
kk: Ойын-сауық

# category_health
source: Здоровье
en: Health
kk: Денсаулық

# category_clothing
source: Одежда
en: Clothing
kk: Киім

# category_education
source: Образование
en: Education
kk: Білім

# category_subscriptions
source: Подписки
en: Subscriptions
kk: Жазылымдар

# category_transfers
source: Переводы
en: Transfers
kk: Аударымдар

# category_income
source: Доход
en: Income
kk: Кіріс

# category_other
source: Другое
en: Other
kk: Басқа

# amount
source: Сумма
en: Amount
kk: Сома

# date
source: Дата
en: Date
kk: Күні

# save
source: Сохранить
en: Save
kk: Сақтау

# cancel
source: Отмена
en: Cancel
kk: Бас тарту

# edit
source: Изменить
en: Edit
kk: Өзгерту

# edit_transaction_title
source: Редактировать
en: Edit Transaction
kk: Транзакцияны өзгерту

# delete_transaction
source: Удалить транзакцию
en: Delete Transaction
kk: Транзакцияны жою

# delete_transaction_confirm
source: Вы уверены, что хотите удалить эту транзакцию?
en: Are you sure you want to delete this transaction?
kk: Бұл транзакцияны жоюға сенімдісіз бе?

# error
source: Ошибка
en: Error
kk: Қате

# total_expenses
source: Общие расходы
en: Total Expenses
kk: Жалпы шығындар

# total_income
source: Общий доход
en: Total Income
kk: Жалпы кіріс

# no_transactions
source: Нет транзакций
en: No transactions
kk: Транзакциялар жоқ

# import_pdf
source: Импорт из PDF
en: Import from PDF
kk: PDF-тен импорт

# select_category
source: Выберите категорию
en: Select category
kk: Санатты таңдаңыз

# note
source: Заметка
en: Note
kk: Жазба

# balance
source: Баланс
en: Balance

# expenses_by_category
source: Расходы по категориям
en: Expenses by category
kk: Санат бойынша шығындар

# total
source: Итого
en: Total
kk: Барлығы

# today
source: Сегодня
en: Today
kk: Бүгін

# yesterday
source: Вчера
en: Yesterday
kk: Кеше

# delete
source: Удалить
en: Delete
kk: Жою

# no_transactions_hint
source: Добавьте транзакцию или импортируйте выписку
en: Add a transaction or import a statement
kk: Транзакция қосыңыз немесе үзінді көшірмені импорттаңыз

# done
source: Готово
en: Done
kk: Дайын

# transaction_type
source: Тип операции
en: Transaction type
kk: Операция түрі

# expense
source: Расход
en: Expense
kk: Шығыс

# income_type
source: Доход
en: Income
kk: Кіріс

# transaction_saved
source: Транзакция сохранена
en: Transaction saved
kk: Транзакция сақталды

# import_description
source: Выберите PDF-выписку из Kaspi или Halyk для автоматического импорта транзакций
en: Select a PDF statement from Kaspi or Halyk to automatically import transactions
kk: Транзакцияларды автоматты импорттау үшін Kaspi немесе Halyk PDF үзінді көшірмесін таңдаңыз

# select_pdf
source: Выбрать PDF
en: Select PDF
kk: PDF таңдау

# error_pdf_read
source: Не удалось прочитать PDF файл
en: Failed to read PDF file
kk: PDF файлды оқу мүмкін болмады

# parsed_transactions %lld
source: Найдено транзакций: %lld
en: %lld transactions found
kk: %lld транзакция табылды

# duplicates_skipped %lld
source: Дубликатов пропущено: %lld
en: %lld duplicates skipped
kk: %lld көшірме өткізілді

# review_transactions
source: Проверьте транзакции
en: Review transactions
kk: Транзакцияларды тексеріңіз

# save_transactions %lld
source: Сохранить %lld транзакций
en: Save %lld transactions
kk: %lld транзакцияны сақтау

# import_success
source: Импорт завершён
en: Import complete
kk: Импорт аяқталды

# subscriptions_title
source: Подписки
en: Subscriptions
kk: Жазылымдар

# monthly_total
source: Ежемесячно
en: Monthly total
kk: Ай сайын

# active_subscriptions
source: Активные подписки
en: Active subscriptions
kk: Белсенді жазылымдар

# no_subscriptions
source: Нет подписок
en: No subscriptions
kk: Жазылымдар жоқ

# no_subscriptions_hint
source: Подписки автоматически определяются при импорте выписки
en: Subscriptions are automatically detected when importing a statement
kk: Жазылымдар үзінді көшірмені импорттағанда автоматты анықталады

# times %lld
source: %lld раз
en: %lld times
kk: %lld рет

# appearance
source: Оформление
en: Appearance
kk: Сыртқы түрі

# system_appearance
source: Системная тема
en: System appearance
kk: Жүйелік тема

# appearance_hint
source: Тёмная и светлая тема переключается в Настройках iOS
en: Dark and light mode follows iOS system settings
kk: Қараңғы және жарық тема iOS баптауларында ауысады

# data_and_backup
source: Данные
en: Data & Backup
kk: Деректер

# erase_all_data
source: Удалить все данные
en: Erase all data
kk: Барлық деректерді жою

# erase_all_title
source: Удалить все данные?
en: Erase all data?
kk: Барлық деректерді жою?

# erase_all_message
source: Все транзакции будут безвозвратно удалены. Это действие нельзя отменить.
en: All transactions will be permanently deleted. This cannot be undone.
kk: Барлық транзакциялар біржола жойылады. Бұл әрекетті кері қайтару мүмкін емес.

# erase_all_confirm
source: Удалить всё
en: Erase everything
kk: Барлығын жою

# data_erased
source: Данные удалены
en: Data erased
kk: Деректер жойылды

# about
source: О приложении
en: About
kk: Қолданба туралы

# app_version
source: Версия
en: Version
kk: Нұсқа

# tab_analytics
source: Аналитика
en: Analytics
kk: Талдау

# segment_all
source: Все
en: All
kk: Барлығы

# segment_expenses
source: Расходы
en: Expenses
kk: Шығыстар

# segment_income
source: Доходы
en: Income
kk: Кірістер

# period
source: Период
en: Period
kk: Кезең

# period_week
source: Неделя
en: Week
kk: Апта

# period_month
source: Месяц
en: Month
kk: Ай

# period_year
source: Год
en: Year
kk: Жыл

# filters
source: Фильтры
en: Filters
kk: Сүзгілер

# apply
source: Применить
en: Apply
kk: Қолдану

# reset
source: Сбросить
en: Reset
kk: Тазалау

# date_range
source: Диапазон дат
en: Date range
kk: Күндер аралығы

# filter_by_date
source: Фильтр по дате
en: Filter by date
kk: Күн бойынша сүзу

# from_date
source: С
en: From
kk: Бастап

# to_date
source: По
en: To
kk: Дейін

# categories_filter
source: Категории
en: Categories
kk: Санаттар

# details
source: Детали
en: Details
kk: Мәліметтер

# time_label
source: Время
en: Time
kk: Уақыт

# subscription_badge
source: Подписка
en: Subscription
kk: Жазылым

# transaction_detail_title
source: Транзакция
en: Transaction

# transactions_count %lld
source: %lld транзакций
en: %lld transactions
kk: %lld транзакция

# insight_title
source: AI Совет
en: AI Insight
kk: AI Кеңес

# insight_placeholder
source: Анализируем ваши расходы. Подключите AI-коуч для персональных рекомендаций по экономии.
en: Analyzing your spending. Connect AI coach for personalized savings tips.
kk: Шығындарыңызды талдаудамыз. Жеке үнемдеу кеңестері үшін AI-коучты қосыңыз.

# insight_more
source: Подробнее
en: Learn more
kk: Толығырақ

# insight_detail_title
source: AI Анализ
en: AI Analysis
kk: AI Талдау

# insight_subtitle
source: Персональный финансовый анализ
en: Personal financial analysis
kk: Жеке қаржылық талдау

# insight_top_category
source: Топ категория расходов
en: Top spending category
kk: Жоғарғы шығын санаты

# insight_tip_title
source: Совет
en: Tip
kk: Кеңес

# insight_tip_body
source: Отслеживайте расходы каждую неделю, чтобы замечать тренды раньше, чем они станут проблемой.
en: Track your spending weekly to spot trends before they become problems.
kk: Апта сайын шығындарды бақылаңыз — үрдістерді ерте анықтаңыз.

# insight_coming_soon
source: Персональные AI-рекомендации — в следующем обновлении
en: Personalised AI recommendations coming soon
kk: Жеке AI ұсыныстары жақында қосылады

# mark_as_subscription
source: Отметить как подписку
en: Mark as subscription
kk: Жазылым ретінде белгілеу

# none
source: Нет данных
en: None
kk: Жоқ

# import_statement
source: Импорт выписки
en: Import statement
kk: Үзінді импорттау

# profile_title
source: Профиль
en: Profile

# profile_name_placeholder
source: Пользователь
en: User
kk: Пайдаланушы

# profile_subtitle
source: Личный бюджет
en: Personal budget
kk: Жеке бюджет

# profile_accounts
source: Счета
en: Accounts
kk: Шоттар

# coming_soon
source: Скоро
en: Coming soon
kk: Жақында

# close
source: Закрыть
en: Close
kk: Жабу

# feature_ai_coach_name
source: AI Финансовый советник
en: AI Financial Coach
kk: AI Қаржы кеңесшісі

# feature_ai_coach_description
source: Персональный анализ расходов и советы по экономии на основе ваших данных.
en: Personalised spending analysis and savings tips based on your data.
kk: Деректеріңізге негізделген жеке шығын талдауы және үнемдеу кеңестері.

# feature_financial_lessons_name
source: Финансовая грамотность
en: Financial Literacy
kk: Қаржылық сауаттылық

# feature_financial_lessons_description
source: Уроки и статьи по личным финансам для казахстанских пользователей.
en: Lessons and articles on personal finance for Kazakhstani users.
kk: Қазақстандық пайдаланушыларға арналған жеке қаржы сабақтары мен мақалалары.

# feature_advanced_import_name
source: Расширенный импорт
en: Advanced Import
kk: Кеңейтілген импорт

# feature_advanced_import_description
source: Импорт выписок Halyk Bank, распознавание скриншотов и объединение счетов.
en: Halyk Bank statement import, screenshot OCR, and multi-account merge.
kk: Halyk Bank үзінділерін импорттау, скриншоттарды тану және шоттарды біріктіру.

# benefit_ai_1
source: Еженедельный AI-отчёт по расходам
en: Weekly AI spending report
kk: Апталық AI шығын есебі

# benefit_ai_2
source: Персональные советы по экономии в ₸
en: Personalised savings tips in ₸
kk: ₸ бойынша жеке үнемдеу кеңестері

# benefit_ai_3
source: Прогноз бюджета на следующий месяц
en: Next-month budget forecast
kk: Келесі айдың бюджет болжамы

# benefit_lessons_1
source: 20+ уроков по личным финансам
en: 20+ personal finance lessons
kk: 20+ жеке қаржы сабақтары

# benefit_lessons_2
source: Адаптировано для казахстанского рынка
en: Tailored for the Kazakhstani market
kk: Қазақстан нарығына бейімделген

# benefit_import_1
source: Импорт выписок Halyk Bank
en: Halyk Bank statement import
kk: Halyk Bank үзінділерін импорттау

# benefit_import_2
source: Распознавание скриншотов (OCR)
en: Screenshot recognition (OCR)
kk: Скриншоттарды тану (OCR)

# benefit_import_3
source: Объединение нескольких счетов
en: Multi-account merge
kk: Бірнеше шотты біріктіру

# paywall_price_placeholder
source: ₸ в месяц
en: ₸ / month
kk: ₸ / ай

# paywall_price_note
source: Цена будет определена при запуске
en: Price will be set at launch
kk: Баға іске қосу кезінде белгіленеді

# paywall_subscribe
source: Оформить подписку
en: Subscribe
kk: Жазылу

# paywall_restore
source: Восстановить покупки
en: Restore purchases
kk: Сатып алуларды қалпына келтіру

# paywall_legal
source: Подписка автоматически продлевается. Отмена — в настройках App Store.
en: Subscription renews automatically. Cancel anytime in App Store settings.
kk: Жазылым автоматты түрде жаңарады. App Store параметрлерінде болдырмауға болады.

# paywall_coming_soon
source: Оплата будет доступна в следующем обновлении
en: Payment coming in next update
kk: Төлем келесі жаңартуда қолжетімді болады

# paywall_nothing_to_restore
source: Активных покупок не найдено. Если вы уже подписались — проверьте, что используете тот же Apple ID.
en: No active purchases found. If you've already subscribed, make sure you're using the same Apple ID.
kk: Белсенді сатып алулар табылмады. Егер жазылсаңыз, сол Apple ID пайдаланылатынын тексеріңіз.

# restore_result_title
source: Восстановление покупок
en: Restore purchases
kk: Сатып алуларды қалпына келтіру

# premium_active_title
source: Премиум активен
en: Premium active
kk: Премиум белсенді

# premium_active_subtitle
source: Все функции разблокированы
en: All features unlocked
kk: Барлық мүмкіндіктер ашылды

# premium_cta_title
source: Разблокировать всё
en: Unlock everything
kk: Барлығын ашу

# premium_cta_subtitle
source: AI советник · уроки · расширенный импорт
en: AI coach · lessons · advanced import
kk: AI кеңесші · сабақтар · кеңейтілген импорт

# premium_features_section
source: Премиум функции
en: Premium Features
kk: Премиум мүмкіндіктер

# lessons_coming_description
source: Уроки по личным финансам появятся в следующем обновлении.
en: Personal finance lessons are coming in the next update.
kk: Жеке қаржы сабақтары келесі жаңартуда пайда болады.

# advanced_import_coming_description
source: Расширенный импорт будет доступен в следующем обновлении.
en: Advanced import is coming in the next update.
kk: Кеңейтілген импорт келесі жаңартуда қолжетімді болады.

# advanced_import_planned
source: Запланировано
en: Planned
kk: Жоспарланған

# advanced_import_halyk
source: Выписка Halyk Bank (PDF)
en: Halyk Bank statement (PDF)
kk: Halyk Bank үзіндісі (PDF)

# advanced_import_ocr
source: Распознавание скриншота чека
en: Receipt screenshot OCR
kk: Чек скриншотын тану

# advanced_import_merge
source: Объединение Kaspi + Halyk + наличные
en: Merge Kaspi + Halyk + cash
kk: Kaspi + Halyk + қолма-қол біріктіру

# categories_title
source: Категории
en: Categories
kk: Санаттар

# builtin_categories
source: Встроенные категории
en: Built-in categories
kk: Кіріктірілген санаттар

# categories_hint
source: Пользовательские правила категоризации создаются автоматически при редактировании импорта
en: Custom categorization rules are created automatically when editing imports
kk: Пайдаланушы санаттау ережелері импортты өңдеу кезінде автоматты түрде жасалады

# custom_categories
source: Мои категории
en: My Categories
kk: Менің санаттарым

# no_custom_categories
source: Нет пользовательских категорий
en: No custom categories
kk: Пайдаланушы санаттары жоқ

# add_category
source: Добавить категорию
en: Add Category
kk: Санат қосу

# edit_category
source: Редактировать категорию
en: Edit Category
kk: Санатты өңдеу

# category_name
source: Название
en: Name
kk: Атауы

# category_name_placeholder
source: Например: Авто
en: e.g. Auto
kk: Мысалы: Авто

# icon
source: Иконка
en: Icon
kk: Белгіше

# color
source: Цвет
en: Color
kk: Түс

# delete_category_confirm
source: Удалить категорию?
en: Delete category?
kk: Санатты жою?

# delete_category_message
source: Все транзакции этой категории будут перенесены в «Другое». Это действие нельзя отменить.
en: All transactions in this category will be moved to "Other". This cannot be undone.
kk: Бұл санаттағы барлық транзакциялар «Басқа» бөліміне көшіріледі. Бұл әрекетті қайтару мүмкін емес.

# delete_subcategory_confirm
source: Удалить подкатегорию?
en: Delete subcategory?
kk: Санатшаны жою?

# add_subcategory
source: Добавить подкатегорию
en: Add Subcategory
kk: Санатша қосу

# edit_subcategory
source: Редактировать подкатегорию
en: Edit Subcategory
kk: Санатшаны өңдеу

# subcategory_name
source: Название подкатегории
en: Subcategory Name
kk: Санатша атауы

# subcategory_name_placeholder
source: Например: Бензин
en: e.g. Gas
kk: Мысалы: Бензин

# deactivate
source: Деактивировать
en: Deactivate
kk: Өшіру

# activate
source: Активировать
en: Activate
kk: Қосу

# notifications_title
source: Уведомления
en: Notifications
kk: Хабарламалар

# reminders
source: Напоминания
en: Reminders
kk: Еске салулар

# daily_reminder
source: Ежедневное напоминание
en: Daily reminder
kk: Күнделікті еске салу

# weekly_digest
source: Еженедельный отчёт
en: Weekly digest
kk: Апталық есеп

# notifications_hint
source: Настройки уведомлений сохраняются локально на устройстве
en: Notification settings are stored locally on your device
kk: Хабарлама параметрлері құрылғыда жергілікті сақталады

# export_title
source: Экспорт данных
en: Export data
kk: Деректерді экспорттау

# export_description
source: Экспортируйте свои транзакции в удобном формате для анализа или резервного копирования
en: Export your transactions in a convenient format for analysis or backup
kk: Талдау немесе сақтық көшірме жасау үшін транзакцияларыңызды ыңғайлы форматта экспорттаңыз

# export_formats
source: Форматы
en: Formats
kk: Форматтар

# subcategory_label
source: Подкатегория
en: Subcategory
kk: Ішкі санат

# no_subcategories
source: Нет подкатегорий
en: No subcategories
kk: Ішкі санаттар жоқ

# subcategory_groceries
source: Продукты
en: Groceries
kk: Азық-түлік

# subcategory_restaurants
source: Рестораны
en: Restaurants
kk: Мейрамханалар

# subcategory_cafes
source: Кафе
en: Cafes

# subcategory_delivery
source: Доставка
en: Delivery
kk: Жеткізу

# subcategory_fast_food
source: Фаст-фуд
en: Fast food

# subcategory_taxi
source: Такси
en: Taxi

# subcategory_bus
source: Автобус
en: Bus

# subcategory_fuel
source: Топливо
en: Fuel
kk: Жанармай

# subcategory_parking
source: Парковка
en: Parking
kk: Тұрақ

# subcategory_metro
source: Метро
en: Metro

# subcategory_rent
source: Аренда
en: Rent
kk: Жалға алу

# subcategory_mortgage
source: Ипотека
en: Mortgage

# subcategory_repairs
source: Ремонт
en: Repairs
kk: Жөндеу

# subcategory_furniture
source: Мебель
en: Furniture
kk: Жиһаз

# subcategory_electricity
source: Электричество
en: Electricity
kk: Электр

# subcategory_water
source: Вода
en: Water
kk: Су

# subcategory_internet
source: Интернет
en: Internet

# subcategory_phone
source: Телефон
en: Phone

# subcategory_heating
source: Отопление
en: Heating
kk: Жылыту

# subcategory_cinema
source: Кино
en: Cinema

# subcategory_concerts
source: Концерты
en: Concerts
kk: Концерттер

# subcategory_games
source: Игры
en: Games
kk: Ойындар

# subcategory_sports
source: Спорт
en: Sports

# subcategory_hobbies
source: Хобби
en: Hobbies

# subcategory_pharmacy
source: Аптека
en: Pharmacy
kk: Дәріхана

# subcategory_doctor
source: Врач
en: Doctor
kk: Дәрігер

# subcategory_gym
source: Спортзал
en: Gym

# subcategory_insurance
source: Страховка
en: Insurance
kk: Сақтандыру

# subcategory_clothes
source: Одежда
en: Clothes
kk: Киім

# subcategory_shoes
source: Обувь
en: Shoes
kk: Аяқ киім

# subcategory_accessories
source: Аксессуары
en: Accessories
kk: Аксессуарлар

# subcategory_courses
source: Курсы
en: Courses
kk: Курстар

# subcategory_books
source: Книги
en: Books
kk: Кітаптар

# subcategory_tuition
source: Обучение
en: Tuition
kk: Оқу ақысы

# subcategory_streaming
source: Стриминг
en: Streaming

# subcategory_apps
source: Приложения
en: Apps
kk: Қолданбалар

# subcategory_services
source: Сервисы
en: Services
kk: Сервистер

# subcategory_to_person
source: Человеку
en: To person
kk: Адамға

# subcategory_to_card
source: На карту
en: To card
kk: Картаға

# subcategory_to_account
source: На счёт
en: To account
kk: Шотқа

# subcategory_salary
source: Зарплата
en: Salary
kk: Жалақы

# subcategory_freelance
source: Фриланс
en: Freelance

# subcategory_gift
source: Подарок
en: Gift
kk: Сыйлық

# subcategory_cashback
source: Кэшбэк
en: Cashback
